In [1]:
import pandas as pd

In [13]:
df1=pd.DataFrame({'name':['a','b','c'],'salary':[12,13,24]})
df2=pd.DataFrame({'name':['a','d','c'],'age':[12,13,24]})
pd.merge(df1,df2,on='name')

  name  salary  age
0    a      12   12
1    c      24   24

In [15]:
pd.merge(df1,df2,on='name',how='inner')
#p

  name  salary  age
0    a      12   12
1    c      24   24

In [21]:
pd.merge(df1,df2,on='name',how='left')

  name  salary   age
0    a      12  12.0
1    b      13   NaN
2    c      24  24.0

In [17]:
pd.merge(df1,df2,on='name',how='right')

  name  salary  age
0    a    12.0   12
1    d     NaN   13
2    c    24.0   24

In [18]:
pd.merge(df1,df2,on='name',how='outer')

  name  salary   age
0    a    12.0  12.0
1    b    13.0   NaN
2    c    24.0  24.0
3    d     NaN  13.0

In [24]:
df1=pd.read_csv("Downloads/ds_salaries.csv")
print(df1)

     Unnamed: 0  work_year experience_level employment_type  \
0             0       2020               MI              FT
1             1       2020               SE              FT
2             2       2020               SE              FT
3             3       2020               MI              FT
4             4       2020               SE              FT
..          ...        ...              ...             ...
602         602       2022               SE              FT
603         603       2022               SE              FT
604         604       2022               SE              FT
605         605       2022               SE              FT
606         606       2022               MI              FT

                      job_title  salary salary_currency  salary_in_usd  \
0                Data Scientist   70000             EUR          79833
1    Machine Learning Scientist  260000             USD         260000
2             Big Data Engineer   85000             GBP         109024
3          Product Data Analyst   20000             USD          20000
4     Machine Learning Engineer  150000             USD         150000
..                          ...     ...             ...            ...
602               Data Engineer  154000             USD         154000
603               Data Engineer  126000             USD         126000
604                Data Analyst  129000             USD         129000
605                Data Analyst  150000             USD         150000
606                AI Scientist  200000             USD         200000

    employee_residence  remote_ratio company_location company_size
0                   DE             0               DE            L
1                   JP             0               JP            S
2                   GB            50               GB            M
3                   HN             0               HN            S
4                   US            50               US            L
..                 ...           ...              ...          ...
602                 US           100               US            M
603                 US           100               US            M
604                 US             0               US            M
605                 US           100               US            M
606                 IN           100               US            L

[607 rows x 12 columns]

In [34]:
join=df1['work_year'].iloc[0]
print(join)

2020

In [49]:
join=df1['job_title']==2025
print(join)

0                  Data Scientist
1      Machine Learning Scientist
2               Big Data Engineer
3            Product Data Analyst
4       Machine Learning Engineer
                  ...
602                 Data Engineer
603                 Data Engineer
604                  Data Analyst
605                  Data Analyst
606                  AI Scientist
Name: job_title, Length: 607, dtype: object

In [36]:
df1.iloc[0][3:]

employment_type                   FT
job_title             Data Scientist
salary                         70000
salary_currency                  EUR
salary_in_usd                  79833
employee_residence                DE
remote_ratio                       0
company_location                  DE
company_size                       L
Name: 0, dtype: object

In [58]:
df1['job_title'].apply(lambda exp: exp[:2] =='Da')

0       True
1      False
2      False
3      False
4      False
       ...
602     True
603     True
604     True
605     True
606    False
Name: job_title, Length: 607, dtype: bool

In [59]:
df1[df1['job_title'].apply(lambda exp: exp[:2] =='Da')]

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
5,5,2020,EN,FT,Data Analyst,72000,USD,72000,US,100,US,L
7,7,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
10,10,2020,EN,FT,Data Scientist,45000,EUR,51321,FR,0,FR,S
11,11,2020,MI,FT,Data Scientist,3000000,INR,40481,IN,0,IN,L
...,...,...,...,...,...,...,...,...,...,...,...,...
601,601,2022,EN,FT,Data Analyst,52000,USD,52000,CA,0,CA,M
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M

In [63]:
df1[df1['job_title'].apply(lambda exp: exp[:2] =='Da')]['work_year']

0      2020
5      2020
7      2020
10     2020
11     2020
       ...
601    2022
602    2022
603    2022
604    2022
605    2022
Name: work_year, Length: 423, dtype: int64

In [64]:
df1[df1['job_title'].apply(lambda exp: exp[:2] =='Da')][['work_year','job_title']]

     work_year       job_title
0         2020  Data Scientist
5         2020    Data Analyst
7         2020  Data Scientist
10        2020  Data Scientist
11        2020  Data Scientist
..         ...             ...
601       2022    Data Analyst
602       2022   Data Engineer
603       2022   Data Engineer
604       2022    Data Analyst
605       2022    Data Analyst

[423 rows x 2 columns]

## pd.merge(df1, df2, left_on='name', right_on='Sname')
#pd.merge(df1, df2, left_on='name', right_on='Sname', how='left')

In [66]:
df1['job_title'].apply(lambda exp: exp[:2] =='Da').sum()

423

In [ ]:
#pd.merge(df1,df2,left_on='name',right_on='Sname',how='left')

In [76]:
#df1[df1['job_title'].apply(lambda exp: exp[:2] =='Da')].count()
df1['job_title'].apply(lambda exp: exp[:2] =='Da').count() #exp=expration

607

In [73]:
sum(df1['job_title'].apply(lambda exp: exp[:2] =='Da'))

423